base/spec/fixtures/charge_all_response_from_stripe_23_objects.json

[
  {
    "id": "ch_1wx9FbJw3YG5xO",
    "object": "charge",
    "created": 1370286211,
    "livemode": false,
    "paid": true,
    "amount": 995,
    "currency": "usd",
    "refunded": false,
    "fee": 59,
    "fee_details": [
      {
        "amount": 59,
        "currency": "usd",
        "type": "stripe_fee",
        "description": "Stripe processing fees",
        "application": null,
        "amount_refunded": 0
      }
    ],
    "card": {
      "object": "card",
      "last4": "4242",
      "type": "Visa",
      "exp_month": 2,
      "exp_year": 2013,
      "fingerprint": "eN9ATrlnOMYF6yIq",
      "country": "US",
      "address_city": null
    },
    "captured": true,
    "failure_code": null,
    "customer": "cus_0HYml6si3UFTP7",
    "invoice": "in_1vpRLqfSqbpHxd",
    "dispute": null,
    "disputed": false
  },
  {
    "id": "ch_1wx9gzG15ZUPRt",
    "object": "charge",
    "created": 1370286210,
    "livemode": false,
    "paid": true,
    "amount": 995,
    "currency": "usd",
    "refunded": false,
    "fee": 59,
    "fee_details": [
      {
        "amount": 59,
        "currency": "usd",
        "type": "stripe_fee",
        "description": "Stripe processing fees",
        "application": null,
        "amount_refunded": 0
      }
    ],
    "card": {
      "object": "card",
      "last4": "4242",
      "type": "Visa",
      "exp_month": 2,
      "exp_year": 2013,
      "fingerprint": "eN9ATrlnOMYF6yIq",
      "country": "US",
      "address_city": null
    },
    "captured": true,
    "failure_code": null,
    "customer": "cus_0HYmzJGa7Se52L",
    "invoice": "in_1vpRG8dFU6j872",
    "dispute": null,
    "disputed": false
  },
  {
    "id": "ch_1ww5d0BwVoKxVp",
    "object": "charge",
    "created": 1370282280,
    "livemode": false,
    "paid": true,
    "amount": 995,
    "currency": "usd",
    "refunded": false,
    "fee": 59,
    "fee_details": [
      {
        "amount": 59,
        "currency": "usd",
        "type": "stripe_fee",
        "description": "Stripe processing fees",
        "application": null,
        "amount_refunded": 0
      }
    ],
    "card": {
      "object": "card",
      "last4": "4242",
      "type": "Visa",
      "exp_month": 12,
      "exp_year": 2014,
      "fingerprint": "eN9ATrlnOMYF6yIq",
      "country": "US",
      "address_city": null
    },
    "captured": true,
    "failure_code": null,
    "customer": "cus_0Z9LJdcymJEJXK",
    "invoice": "in_1voOw2Qb70SQWR",
    "dispute": null,
    "disputed": false
  },
  {
    "id": "ch_1wu2dZuxB4ekei",
    "object": "charge",
    "created": 1370274676,
    "livemode": false,
    "paid": true,
    "amount": 995,
    "currency": "usd",
    "refunded": false,
    "fee": 59,
    "fee_details": [
      {
        "amount": 59,
        "currency": "usd",
        "type": "stripe_fee",
        "description": "Stripe processing fees",
        "application": null,
        "amount_refunded": 0
      }
    ],
    "card": {
      "object": "card",
      "last4": "4242",
      "type": "Visa",
      "exp_month": 12,
      "exp_year": 2013,
      "fingerprint": "eN9ATrlnOMYF6yIq",
      "country": "US",
      "address_city": null
    },
    "captured": true,
    "failure_code": null,
    "customer": "cus_0Z7I0396KifB94",
    "invoice": "in_1vmMbwLo5m9HJU",
    "dispute": null,
    "disputed": false
  },
  {
    "id": "ch_1wgdUUN9Cvyfol",
    "object": "charge",
    "created": 1370224804,
    "livemode": false,
    "paid": true,
    "amount": 2900,
    "currency": "usd",
    "refunded": false,
    "fee": 114,
    "fee_details": [
      {
        "amount": 114,
        "currency": "usd",
        "type": "stripe_fee",
        "description": "Stripe processing fees",
        "application": null,
        "amount_refunded": 0
      }
    ],
    "card": {
      "object": "card",
      "last4": "4242",
      "type": "Visa",
      "exp_month": 2,
      "exp_year": 2013,
      "fingerprint": "eN9ATrlnOMYF6yIq",
      "country": "US",
      "address_city": null
    },
    "captured": true,
    "failure_code": null,
    "customer": "cus_05gHq2JQ7TqE7i",
    "invoice": "in_1vYxV4JiRacRYM",
    "dispute": null,
    "disputed": false
  },
  {
    "id": "ch_1wgdlV4KpiZZPl",
    "object": "charge",
    "created": 1370224801,
    "livemode": false,
    "paid": true,
    "amount": 300,
    "currency": "usd",
    "refunded": false,
    "fee": 39,
    "fee_details": [
      {
        "amount": 39,
        "currency": "usd",
        "type": "stripe_fee",
        "description": "Stripe processing fees",
        "application": null,
        "amount_refunded": 0
      }
    ],
    "card": {
      "object": "card",
      "last4": "4242",
      "type": "Visa",
      "exp_month": 2,
      "exp_year": 2013,
      "fingerprint": "eN9ATrlnOMYF6yIq",
      "country": "US",
      "address_city": null
    },
    "captured": true,
    "failure_code": null,
    "customer": "cus_05gHqOaQ9x67Cw",
    "invoice": "in_1vYxVQLJ1zRZ0f",
    "dispute": null,
    "disputed": false
  },
  {
    "id": "ch_1wgXGmIYxJZJBk",
    "object": "charge",
    "created": 1370224439,
    "livemode": false,
    "paid": true,
    "amount": 2900,
    "currency": "usd",
    "refunded": false,
    "fee": 114,
    "fee_details": [
      {
        "amount": 114,
        "currency": "usd",
        "type": "stripe_fee",
        "description": "Stripe processing fees",
        "application": null,
        "amount_refunded": 0
      }
    ],
    "card": {
      "object": "card",
      "last4": "4242",
      "type": "Visa",
      "exp_month": 2,
      "exp_year": 2013,
      "fingerprint": "eN9ATrlnOMYF6yIq",
      "country": "US",
      "address_city": null
    },
    "captured": true,
    "failure_code": null,
    "customer": "cus_05gBhTx0JYqCx3",
    "invoice": "in_1vYrmmFZjCxdsD",
    "dispute": null,
    "disputed": false
  },
  {
    "id": "ch_1wgXdKnIvfjEv4",
    "object": "charge",
    "created": 1370224438,
    "livemode": false,
    "paid": true,
    "amount": 300,
    "currency": "usd",
    "refunded": false,
    "fee": 39,
    "fee_details": [
      {
        "amount": 39,
        "currency": "usd",
        "type": "stripe_fee",
        "description": "Stripe processing fees",
        "application": null,
        "amount_refunded": 0
      }
    ],
    "card": {
      "object": "card",
      "last4": "4242",
      "type": "Visa",
      "exp_month": 2,
      "exp_year": 2013,
      "fingerprint": "eN9ATrlnOMYF6yIq",
      "country": "US",
      "address_city": null
    },
    "captured": true,
    "failure_code": null,
    "customer": "cus_05gBuuww6oNXNQ",
    "invoice": "in_1vYriQDd6dwtgp",
    "dispute": null,
    "disputed": false
  },
  {
    "id": "ch_1wgFyxK5IySIm0",
    "object": "charge",
    "created": 1370223348,
    "livemode": false,
    "paid": true,
    "amount": 2900,
    "currency": "usd",
    "refunded": false,
    "fee": 114,
    "fee_details": [
      {
        "amount": 114,
        "currency": "usd",
        "type": "stripe_fee",
        "description": "Stripe processing fees",
        "application": null,
        "amount_refunded": 0
      }
    ],
    "card": {
      "object": "card",
      "last4": "4242",
      "type": "Visa",
      "exp_month": 2,
      "exp_year": 2013,
      "fingerprint": "eN9ATrlnOMYF6yIq",
      "country": "US",
      "address_city": null
    },
    "captured": true,
    "failure_code": null,
    "customer": "cus_05fsTH1e0uBOpe",
    "invoice": "in_1vYYMdhcLPJucw",
    "dispute": null,
    "disputed": false
  },
  {
    "id": "ch_1wgFpyEkdmzOZ0",
    "object": "charge",
    "created": 1370223347,
    "livemode": false,
    "paid": true,
    "amount": 300,
    "currency": "usd",
    "refunded": false,
    "fee": 39,
    "fee_details": [
      {
        "amount": 39,
        "currency": "usd",
        "type": "stripe_fee",
        "description": "Stripe processing fees",
        "application": null,
        "amount_refunded": 0
      }
    ],
    "card": {
      "object": "card",
      "last4": "4242",
      "type": "Visa",
      "exp_month": 2,
      "exp_year": 2013,
      "fingerprint": "eN9ATrlnOMYF6yIq",
      "country": "US",
      "address_city": null
    },
    "captured": true,
    "failure_code": null,
    "customer": "cus_05fskmMlbJNH8E",
    "invoice": "in_1vYY7tyynNVOfX",
    "dispute": null,
    "disputed": false
  },
  {
    "id": "ch_1wZuN6Cm5HS2Vv",
    "object": "charge",
    "created": 1370199774,
    "livemode": false,
    "paid": true,
    "amount": 995,
    "currency": "usd",
    "refunded": false,
    "fee": 59,
    "fee_details": [
      {
        "amount": 59,
        "currency": "usd",
        "type": "stripe_fee",
        "description": "Stripe processing fees",
        "application": null,
        "amount_refunded": 0
      }
    ],
    "card": {
      "object": "card",
      "last4": "4242",
      "type": "Visa",
      "exp_month": 12,
      "exp_year": 2014,
      "fingerprint": "eN9ATrlnOMYF6yIq",
      "country": "US",
      "address_city": null
    },
    "captured": true,
    "failure_code": null,
    "customer": "cus_0YnAf53A6QmeUe",
    "invoice": "in_1vSD1QjibJwZaf",
    "dispute": null,
    "disputed": false
  },
  {
    "id": "ch_1wZKHcWaH35kOe",
    "object": "charge",
    "created": 1370197621,
    "livemode": false,
    "paid": true,
    "amount": 995,
    "currency": "usd",
    "refunded": false,
    "fee": 59,
    "fee_details": [
      {
        "amount": 59,
        "currency": "usd",
        "type": "stripe_fee",
        "description": "Stripe processing fees",
        "application": null,
        "amount_refunded": 0
      }
    ],
    "card": {
      "object": "card",
      "last4": "4242",
      "type": "Visa",
      "exp_month": 12,
      "exp_year": 2014,
      "fingerprint": "eN9ATrlnOMYF6yIq",
      "country": "US",
      "address_city": null
    },
    "captured": true,
    "failure_code": null,
    "customer": "cus_0Ymbni24nGGdMJ",
    "invoice": "in_1vRdInsGOvqXPu",
    "dispute": null,
    "disputed": false
  },
  {
    "id": "ch_1wXi69K8eSOPqH",
    "object": "charge",
    "created": 1370191580,
    "livemode": false,
    "paid": true,
    "amount": 1490,
    "currency": "usd",
    "refunded": false,
    "fee": 73,
    "fee_details": [
      {
        "amount": 73,
        "currency": "usd",
        "type": "stripe_fee",
        "description": "Stripe processing fees",
        "application": null,
        "amount_refunded": 0
      }
    ],
    "card": {
      "object": "card",
      "last4": "4242",
      "type": "Visa",
      "exp_month": 10,
      "exp_year": 2024,
      "fingerprint": "eN9ATrlnOMYF6yIq",
      "country": "US",
      "address_city": null
    },
    "captured": true,
    "failure_code": null,
    "customer": "cus_0BuBdbTxKBzPTj",
    "invoice": "in_1vQ09bCzBskE5x",
    "dispute": null,
    "disputed": false
  },
  {
    "id": "ch_1wWWJllxCQyXwq",
    "object": "charge",
    "created": 1370187168,
    "livemode": false,
    "paid": true,
    "amount": 1490,
    "currency": "usd",
    "refunded": false,
    "fee": 73,
    "fee_details": [
      {
        "amount": 73,
        "currency": "usd",
        "type": "stripe_fee",
        "description": "Stripe processing fees",
        "application": null,
        "amount_refunded": 0
      }
    ],
    "card": {
      "object": "card",
      "last4": "4242",
      "type": "Visa",
      "exp_month": 10,
      "exp_year": 2014,
      "fingerprint": "eN9ATrlnOMYF6yIq",
      "country": "US",
      "address_city": null
    },
    "captured": true,
    "failure_code": null,
    "customer": "cus_0Bt0n7UnW87PxR",
    "invoice": "in_1vOpefbGeUrQa8",
    "dispute": null,
    "disputed": false
  },
  {
    "id": "ch_1wWBWFzHHIGj4h",
    "object": "charge",
    "created": 1370185922,
    "livemode": false,
    "paid": true,
    "amount": 1490,
    "currency": "usd",
    "refunded": false,
    "fee": 73,
    "fee_details": [
      {
        "amount": 73,
        "currency": "usd",
        "type": "stripe_fee",
        "description": "Stripe processing fees",
        "application": null,
        "amount_refunded": 0
      }
    ],
    "card": {
      "object": "card",
      "last4": "4242",
      "type": "Visa",
      "exp_month": 9,
      "exp_year": 2013,
      "fingerprint": "eN9ATrlnOMYF6yIq",
      "country": "US",
      "address_city": null
    },
    "captured": true,
    "failure_code": null,
    "customer": "cus_0BsfxraJGlrJPo",
    "invoice": "in_1vOUSPGYeW9ZUU",
    "dispute": null,
    "disputed": false
  },
  {
    "id": "ch_1wW7FM0tcc1dlo",
    "object": "charge",
    "created": 1370185641,
    "livemode": false,
    "paid": true,
    "amount": 1490,
    "currency": "usd",
    "refunded": false,
    "fee": 73,
    "fee_details": [
      {
        "amount": 73,
        "currency": "usd",
        "type": "stripe_fee",
        "description": "Stripe processing fees",
        "application": null,
        "amount_refunded": 0
      }
    ],
    "card": {
      "object": "card",
      "last4": "4242",
      "type": "Visa",
      "exp_month": 10,
      "exp_year": 2014,
      "fingerprint": "eN9ATrlnOMYF6yIq",
      "country": "US",
      "address_city": null
    },
    "captured": true,
    "failure_code": null,
    "customer": "cus_0BsaPwPEICOLUe",
    "invoice": "in_1vOPCUa4vTdeZ5",
    "dispute": null,
    "disputed": false
  },
  {
    "id": "ch_1wVzJ9Seywt3jB",
    "object": "charge",
    "created": 1370185198,
    "livemode": false,
    "paid": true,
    "amount": 1490,
    "currency": "usd",
    "refunded": false,
    "fee": 73,
    "fee_details": [
      {
        "amount": 73,
        "currency": "usd",
        "type": "stripe_fee",
        "description": "Stripe processing fees",
        "application": null,
        "amount_refunded": 0
      }
    ],
    "card": {
      "object": "card",
      "last4": "4242",
      "type": "Visa",
      "exp_month": 10,
      "exp_year": 2014,
      "fingerprint": "eN9ATrlnOMYF6yIq",
      "country": "US",
      "address_city": null
    },
    "captured": true,
    "failure_code": null,
    "customer": "cus_0BsUlkvaKEGUxG",
    "invoice": "in_1vOJChNaYlLJA5",
    "dispute": null,
    "disputed": false
  },
  {
    "id": "ch_1wVjIwG2PTOZpY",
    "object": "charge",
    "created": 1370184256,
    "livemode": false,
    "paid": true,
    "amount": 1490,
    "currency": "usd",
    "refunded": false,
    "fee": 73,
    "fee_details": [
      {
        "amount": 73,
        "currency": "usd",
        "type": "stripe_fee",
        "description": "Stripe processing fees",
        "application": null,
        "amount_refunded": 0
      }
    ],
    "card": {
      "object": "card",
      "last4": "4242",
      "type": "Visa",
      "exp_month": 8,
      "exp_year": 2029,
      "fingerprint": "eN9ATrlnOMYF6yIq",
      "country": "US",
      "address_city": null
    },
    "captured": true,
    "failure_code": null,
    "customer": "cus_0BsFZmAh9QSEAr",
    "invoice": "in_1vO3PQ1HSPa539",
    "dispute": null,
    "disputed": false
  },
  {
    "id": "ch_1wT4KI9TPeHEzS",
    "object": "charge",
    "created": 1370174305,
    "livemode": false,
    "paid": true,
    "amount": 995,
    "currency": "usd",
    "refunded": false,
    "fee": 59,
    "fee_details": [
      {
        "amount": 59,
        "currency": "usd",
        "type": "stripe_fee",
        "description": "Stripe processing fees",
        "application": null,
        "amount_refunded": 0
      }
    ],
    "card": {
      "object": "card",
      "last4": "4242",
      "type": "Visa",
      "exp_month": 2,
      "exp_year": 2013,
      "fingerprint": "eN9ATrlnOMYF6yIq",
      "country": "US",
      "address_city": null
    },
    "captured": true,
    "failure_code": null,
    "customer": "cus_0H4hyHIgdifdHa",
    "invoice": "in_1vLNBo5114osJh",
    "dispute": null,
    "disputed": false
  },
  {
    "id": "ch_1wT4TqBDWMS7VL",
    "object": "charge",
    "created": 1370174304,
    "livemode": false,
    "paid": true,
    "amount": 995,
    "currency": "usd",
    "refunded": false,
    "fee": 59,
    "fee_details": [
      {
        "amount": 59,
        "currency": "usd",
        "type": "stripe_fee",
        "description": "Stripe processing fees",
        "application": null,
        "amount_refunded": 0
      }
    ],
    "card": {
      "object": "card",
      "last4": "4242",
      "type": "Visa",
      "exp_month": 2,
      "exp_year": 2013,
      "fingerprint": "eN9ATrlnOMYF6yIq",
      "country": "US",
      "address_city": null
    },
    "captured": true,
    "failure_code": null,
    "customer": "cus_0H4h9hBresA1d5",
    "invoice": "in_1vLNRAb5LwOGWG",
    "dispute": null,
    "disputed": false
  },
  {
    "id": "ch_1wT2rdwrrVfSig",
    "object": "charge",
    "created": 1370174222,
    "livemode": false,
    "paid": true,
    "amount": 995,
    "currency": "usd",
    "refunded": false,
    "fee": 59,
    "fee_details": [
      {
        "amount": 59,
        "currency": "usd",
        "type": "stripe_fee",
        "description": "Stripe processing fees",
        "application": null,
        "amount_refunded": 0
      }
    ],
    "card": {
      "object": "card",
      "last4": "4242",
      "type": "Visa",
      "exp_month": 2,
      "exp_year": 2013,
      "fingerprint": "eN9ATrlnOMYF6yIq",
      "country": "US",
      "address_city": null
    },
    "captured": true,
    "failure_code": null,
    "customer": "cus_0H4gDL4LBVqCbh",
    "invoice": "in_1vLLOSSDQYETeH",
    "dispute": null,
    "disputed": false
  },
  {
    "id": "ch_1wT2CMSq6y0oo5",
    "object": "charge",
    "created": 1370174221,
    "livemode": false,
    "paid": true,
    "amount": 995,
    "currency": "usd",
    "refunded": false,
    "fee": 59,
    "fee_details": [
      {
        "amount": 59,
        "currency": "usd",
        "type": "stripe_fee",
        "description": "Stripe processing fees",
        "application": null,
        "amount_refunded": 0
      }
    ],
    "card": {
      "object": "card",
      "last4": "4242",
      "type": "Visa",
      "exp_month": 2,
      "exp_year": 2013,
      "fingerprint": "eN9ATrlnOMYF6yIq",
      "country": "US",
      "address_city": null
    },
    "captured": true,
    "failure_code": null,
    "customer": "cus_0H4gWEOkxcQd9d",
    "invoice": "in_1vLLB7GdcNspF2",
    "dispute": null,
    "disputed": false
  },
  {
    "id": "ch_1wM9sfJogV1vl7",
    "object": "charge",
    "created": 1370148618,
    "livemode": false,
    "paid": true,
    "amount": 995,
    "currency": "usd",
    "refunded": false,
    "fee": 59,
    "fee_details": [
      {
        "amount": 59,
        "currency": "usd",
        "type": "stripe_fee",
        "description": "Stripe processing fees",
        "application": null,
        "amount_refunded": 0
      }
    ],
    "card": {
      "object": "card",
      "last4": "4242",
      "type": "Visa",
      "exp_month": 2,
      "exp_year": 2013,
      "fingerprint": "eN9ATrlnOMYF6yIq",
      "country": "US",
      "address_city": null
    },
    "captured": true,
    "failure_code": null,
    "customer": "cus_0GxnrslRtvXtNT",
    "invoice": "in_1vES1pFVGidALb",
    "dispute": null,
    "disputed": false
  }
]
